#### Terraform Workspace 📖`staging`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

terraform
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
[0m[1maws_vpc.vpc: Refreshing state... [id=vpc-08cb6e272e0c4a753][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_subnet.subnet["data_aza"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "192.168.128.0/18"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "staging-data_aza"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "staging-data_aza"
        }
      [32m+[0m[0m vpc_id                                         = "vpc-08cb6e272e0c4a753"
    }

[1m  # aws_subnet.subnet["data_azb"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "192.168.192.0/18"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "staging-data_azb"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "staging-data_azb"
        }
      [32m+[0m[0m vpc_id                                         = "vpc-08cb6e272e0c4a753"
    }

[1m  # aws_subnet.subnet["web_aza"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "192.168.0.0/18"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "staging-web_aza"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "staging-web_aza"
        }
      [32m+[0m[0m vpc_id                                         = "vpc-08cb6e272e0c4a753"
    }

[1m  # aws_subnet.subnet["web_azb"][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "subnet" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-west-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "192.168.64.0/18"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "staging-web_azb"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name" = "staging-web_azb"
        }
      [32m+[0m[0m vpc_id                                         = "vpc-08cb6e272e0c4a753"
    }

[1m  # aws_vpc.vpc[0][0m has moved to [1maws_vpc.vpc[0m
[0m    resource "aws_vpc" "vpc" {
        id                                   = "vpc-08cb6e272e0c4a753"
        tags                                 = {
            "Name" = "staging-network"
        }
        [90m# (15 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @owen-eternal, Action: `pull_request`, Workflow: `Terraform`*